---
kind: type
id: T:Autodesk.Revit.DB.ViewDisplayBackgroundImageFlags
source: html/71eaa252-5e4c-ee0b-0096-fc06fddeff11.htm
---
# Autodesk.Revit.DB.ViewDisplayBackgroundImageFlags

A collection of bit flags that control how the background image is positioned
 in relation to the crop region (or the view boundary).

## Syntax (C#)
```csharp
public enum ViewDisplayBackgroundImageFlags
```